In [1]:
import numpy as np
import pandas as pd
from pandas import DataFrame,Series

In [2]:
df = DataFrame({'k1':['X','X','Y','Y','Z'],
                    'k2':['alpha','beta','alpha','beta','alpha'],
                    'dataset1':np.random.randn(5),
                    'dataset2':np.random.randn(5)})

In [3]:
df

   dataset1  dataset2 k1     k2
0 -0.992664  0.870231  X  alpha
1 -1.066771  0.251547  X   beta
2  1.085311 -0.717890  Y  alpha
3 -1.289146  1.430022  Y   beta
4  0.333670 -0.063645  Z  alpha

In [4]:
grp1=df['dataset1'].groupby(df['k1'])

In [6]:
grp1

In [7]:
grp1.mean()

k1
X   -1.029718
Y   -0.101917
Z    0.333670
Name: dataset1, dtype: float64

In [8]:
cities = np.array(['NY','LA','LA','NY','NY'])
month = np.array(['JAN','FEB','JAN','FEB','JAN'])

In [9]:
df

   dataset1  dataset2 k1     k2
0 -0.992664  0.870231  X  alpha
1 -1.066771  0.251547  X   beta
2  1.085311 -0.717890  Y  alpha
3 -1.289146  1.430022  Y   beta
4  0.333670 -0.063645  Z  alpha

In [10]:
df['dataset1'].groupby([cities,month]).mean()

LA  FEB   -1.066771
    JAN    1.085311
NY  FEB   -1.289146
    JAN   -0.329497
Name: dataset1, dtype: float64

In [11]:
df.groupby('k1').mean()

    dataset1  dataset2
k1
X  -1.029718  0.560889
Y  -0.101917  0.356066
Z   0.333670 -0.063645

In [12]:
df.groupby(['k1','k2']).mean()

          dataset1  dataset2
k1 k2
X  alpha -0.992664  0.870231
   beta  -1.066771  0.251547
Y  alpha  1.085311 -0.717890
   beta  -1.289146  1.430022
Z  alpha  0.333670 -0.063645

In [13]:
df.groupby('k1').size()

k1
X    2
Y    2
Z    1
dtype: int64

In [14]:
for name,group in df.groupby('k1'):
    print "This is the %s group" %name
    print group
    print '\n'

This is the X group
   dataset1  dataset2 k1     k2
0 -0.992664  0.870231  X  alpha
1 -1.066771  0.251547  X   beta


This is the Y group
   dataset1  dataset2 k1     k2
2  1.085311 -0.717890  Y  alpha
3 -1.289146  1.430022  Y   beta


This is the Z group
   dataset1  dataset2 k1     k2
4   0.33367 -0.063645  Z  alpha

In [15]:
for (k1,k2) , group in df.groupby(['k1','k2']):
    print "Key1 = %s Key2 = %s" %(k1,k2)
    print group
    print '\n'

Key1 = X Key2 = alpha
   dataset1  dataset2 k1     k2
0 -0.992664  0.870231  X  alpha


Key1 = X Key2 = beta
   dataset1  dataset2 k1    k2
1 -1.066771  0.251547  X  beta


Key1 = Y Key2 = alpha
   dataset1  dataset2 k1     k2
2  1.085311  -0.71789  Y  alpha


Key1 = Y Key2 = beta
   dataset1  dataset2 k1    k2
3 -1.289146  1.430022  Y  beta


Key1 = Z Key2 = alpha
   dataset1  dataset2 k1     k2
4   0.33367 -0.063645  Z  alpha

In [26]:
grp1

In [27]:
list(grp1)

[('X', 0   -1.936024
  1    0.313205
  Name: dataset1, dtype: float64), ('Y', 2    0.116611
  3   -0.279797
  Name: dataset1, dtype: float64), ('Z', 4   -1.225216
  Name: dataset1, dtype: float64)]

In [28]:
grp_dict=dict(list(df.groupby('k1')))

In [29]:
grp_dict

{'X':    dataset1  dataset2 k1     k2
 0 -1.936024  1.194071  X  alpha
 1  0.313205 -0.049503  X   beta, 'Y':    dataset1  dataset2 k1     k2
 2  0.116611 -1.165838  Y  alpha
 3 -0.279797  0.808224  Y   beta, 'Z':    dataset1  dataset2 k1     k2
 4 -1.225216 -1.548716  Z  alpha}

In [33]:
grp_dict.keys()

['Y', 'X', 'Z']

In [34]:
grp_dict['X']

   dataset1  dataset2 k1     k2
0 -1.936024  1.194071  X  alpha
1  0.313205 -0.049503  X   beta

In [37]:
gr2_dict=dict(list(df.groupby(df.dtypes,axis=1)))

In [39]:
gr2_dict.keys()

[dtype('O'), dtype('float64')]

In [18]:
# GroupBy on Series and Dict

In [21]:
animals=DataFrame(np.arange(16).reshape(4,4),columns=['W','X','Y','Z'],index=['Dog','Cat','Bird','Mouse'])

In [22]:
animals

        W   X   Y   Z
Dog     0   1   2   3
Cat     4   5   6   7
Bird    8   9  10  11
Mouse  12  13  14  15

In [30]:
animals.ix[1:2,['W','Y']]=np.nan

In [31]:
animals

          W   X     Y   Z
Dog     0.0   1   2.0   3
Cat     NaN   5   NaN   7
Bird    8.0   9  10.0  11
Mouse  12.0  13  14.0  15

In [32]:
behave={'W':'good','X':'bad','Y':'good','Z':'bad'}

In [36]:
animal_col=animals.groupby(behave,axis=1)
animal_col.sum()

        bad  good
Dog     4.0   2.0
Cat    12.0   NaN
Bird   20.0  18.0
Mouse  28.0  26.0

In [37]:
behave_series=Series(behave)

In [42]:
animals.groupby(behave_series,axis=1).count()

       bad  good
Dog      2     2
Cat      2     0
Bird     2     2
Mouse    2     2

In [43]:
animals

          W   X     Y   Z
Dog     0.0   1   2.0   3
Cat     NaN   5   NaN   7
Bird    8.0   9  10.0  11
Mouse  12.0  13  14.0  15

In [46]:
animals.groupby(len).sum()

      W   X     Y   Z
3   0.0   6   2.0  10
4   8.0   9  10.0  11
5  12.0  13  14.0  15

In [47]:
keys=['A','B','A','B']

In [48]:
animals.groupby([len,keys]).max()

        W   X     Y   Z
3 A   0.0   1   2.0   3
  B   NaN   5   NaN   7
4 A   8.0   9  10.0  11
5 B  12.0  13  14.0  15

In [49]:
hier_col = pd.MultiIndex.from_arrays([['NY','NY','NY','SF','SF'],[1,2,3,1,2]],names=['City','sub_value'])
hier_col

MultiIndex(levels=[[u'NY', u'SF'], [1, 2, 3]],
           labels=[[0, 0, 0, 1, 1], [0, 1, 2, 0, 1]],
           names=[u'City', u'sub_value'])

In [50]:
dframe_hr = DataFrame(np.arange(25).reshape(5,5),columns=hier_col)

In [52]:
dframe_hr=dframe_hr*100

In [53]:
dframe_hr

City         NY                SF
sub_value     1     2     3     1     2
0             0   100   200   300   400
1           500   600   700   800   900
2          1000  1100  1200  1300  1400
3          1500  1600  1700  1800  1900
4          2000  2100  2200  2300  2400